In [1]:
#Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd

In [3]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var33"])
df

   var1  var2  var33
0     7    11     13
1    12    17     25
2     9    18     19
3    12    23     25
4     3     4      7
5    17    25     24
6    11     9     22
7     2    16     29
8    11    24     26
9     3    14     29

In [4]:
df["var1"]

0     7
1    12
2     9
3    12
4     3
5    17
6    11
7     2
8    11
9     3
Name: var1, dtype: int32

In [5]:
df[0:2]["var1"]

0     7
1    12
Name: var1, dtype: int32

In [6]:
df[0:2][["var1","var2"]]

   var1  var2
0     7    11
1    12    17

In [7]:
df

   var1  var2  var33
0     7    11     13
1    12    17     25
2     9    18     19
3    12    23     25
4     3     4      7
5    17    25     24
6    11     9     22
7     2    16     29
8    11    24     26
9     3    14     29

In [8]:
df.var1

0     7
1    12
2     9
3    12
4     3
5    17
6    11
7     2
8    11
9     3
Name: var1, dtype: int32

In [10]:
df[df.var1 > 15]["var1"]

5    17
Name: var1, dtype: int32

In [11]:
df[df.var1 > 15]

   var1  var2  var33
5    17    25     24

In [13]:
df[(df.var1 > 15) & (df.var33 < 9)]

Empty DataFrame
Columns: [var1, var2, var33]
Index: []

In [14]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
5    17    25

In [16]:
df.loc[(df.var1 > 15)] [["var1","var2"]]

   var1  var2
5    17    25